/* import '../models/aya_model.dart';

String savedGCity = '';

List<AyaModel> ayaModel = [
  AyaModel(
      id: 0,
      ayaBody:
          "(وَبَشِّرِ الصَّابِرِينَ الَّذِينَ إِذَا أَصَابَتْهمْ مصِيبَةٌ قَالوا إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعونَ. أوْلَئِكَ عَلَيْهِمْ صَلَوَاتٌ مِنْ رَبِّهِمْ وَرَحْمَةٌ وَأوْلَئِكَ هم الْمهْتَدونَ) ",
      sourahName: "سورة البقرة: 156-157"),
  AyaModel(
      id: 1,
      ayaBody:
          "(وَأَقِيموا الصَّلَاةَ وَآتوا الزَّكَاةَ ۚ وَمَا تقَدِّموا لِأَنفسِكم مِّنْ خَيْرٍ تَجِدوه عِندَ اللَّهِ ۗ إِنَّ اللَّهَ بِمَا تَعْمَلونَ بَصِيرٌ)",
      sourahName: " سورة البقرة: 110"),
  AyaModel(
      id: 2,
      ayaBody:
          "(أَتَأْمرونَ النَّاسَ بِالْبِرِّ وَتَنسَوْنَ أَنفسَكمْ وَأَنْتمْ تَتْلونَ الْكِتَابَ)",
      sourahName: "سورة البقرة: 44"),
  AyaModel(
      id: 3,
      ayaBody:
          "(رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمؤْمِنِينَ يَوْمَ يَقوم الْحِسَاب)",
      sourahName: " سورة إبراهيم: 41"),
  AyaModel(
      id: 5,
      ayaBody: " (كل من عليها فانٍ . ويبقى وجه ربّك ذو الجلال والإكرام)",
      sourahName: " سورة الرحمن:26-27"),
  AyaModel(
      id: 6,
      ayaBody:
          "(سَمِعْنَا وَأَطَعْنَا غفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِير)",
      sourahName: " سورة البقرة: 285"),
  AyaModel(
      id: 8,
      ayaBody:
          "(رَبَّنَا اغْفِرْ لَنَا ذنوبَنَا وَإِسْرَافَنَا فِي أَمْرِنَا وَثَبِّتْ أَقْدَامَنَا وَانصرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ)",
      sourahName: "سورة آل عمران: 147"),
  AyaModel(
      id: 9,
      ayaBody: "(رَّبِّ اغْفِرْ وَارْحَمْ وَأَنتَ خَيْر الرَّاحِمِينَ)",
      sourahName: "سورة المؤمنون: 118"),
  AyaModel(
      id: 10,
      ayaBody:
          "(رَّبَّنَا عَلَيْكَ تَوَكَّلْنَا وَإِلَيْكَ أَنَبْنَا وَإِلَيْكَ الْمَصِير)",
      sourahName: "سورة الممتحنة: 4"),
  AyaModel(
      id: 11,
      ayaBody:
          "(وَمَن تَقِ السَّيِّئَاتِ يَوْمَئِذٍ فَقَدْ رَحِمْتَه وَذَلِكَ هوَ الْفَوْز الْعَظِيم)",
      sourahName: " سورة غافر: 9"),
  AyaModel(
      id: 11,
      ayaBody:
          " (لَّا إِلَهَ إِلَّا أَنتَ سبْحَانَكَ إِنِّي كنت مِنَ الظَّالِمِينَ)",
      sourahName: "سورة الأنبياء: 87"),
  AyaModel(
      id: 12,
      ayaBody:
          "(وَإِنِّي لَغَفَّارٌ لِّمَن تَابَ وَآمَنَ وَعَمِلَ صَالِحًا ثمَّ اهْتَدَى)",
      sourahName: "سورة طه: 82"),
  AyaModel(
      id: 13,
      ayaBody: "(اللَّه ولي الذين آمنوا يخرجهم من الظلمات إلى النور)",
      sourahName: "سورة البقرة: 257 "),
  AyaModel(
      id: 14,
      ayaBody:
          "(يسْتَبْشِرونَ بِنِعْمَةٍ مِنَ اللَّهِ وَفَضْلٍ وَأَنَّ اللَّهَ لَا يضِيع أَجْرَ الْمؤْمِنِينَ)",
      sourahName: "سورة آل عمران: 171"),
  AyaModel(
      id: 15,
      ayaBody: "(وَيخْرِجهم مِّنَ الظلمَاتِ إِلَى النورِ بِإِذْنِهِ)",
      sourahName: "سورة المائدة: 16"),
  AyaModel(
      id: 16,
      ayaBody:
          "(فَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ خَيْرًا يَرَه * وَمَنْ يَعْمَلْ مِثْقَالَ ذَرَّةٍ شَرًّا يَرَه)",
      sourahName: "سورة الزلزلة: 7-8"),
  AyaModel(
      id: 17,
      ayaBody: "(أَمَّن يجِيب الْمضْطَرَّ إِذَا دَعَاه وَيَكْشِف السّوءَ )",
      sourahName: "سورة النمل: 62"),
  AyaModel(
      id: 18,
      ayaBody:
          "(وَتَوَكَّلْ عَلَى الْحَيِّ الَّذِي لَا يَموت وَسَبِّحْ بِحَمْدِهِ وَكَفَى بِهِ بِذنوبِ عِبَادِهِ خَبِيرًا)",
      sourahName: "سورة الفرقان: 58"),
  AyaModel(
      id: 19,
      ayaBody:
          "(وَلَقَدْ نَعْلَم أَنَّكَ يَضِيق صَدْركَ بِمَا يَقولونَ فَسَبِّحْ بِحَمْدِ رَبِّكَ وَكن مِّنَ السَّاجِدِينَ وَاعْبدْ رَبَّكَ حَتَّى يَأْتِيَكَ الْيَقِين) ",
      sourahName: "سورة الحجر: 97"),
  AyaModel(
      id: 20,
      ayaBody:
          "(إِنَّهُ مَنْ يَتَّقِ وَيَصْبِرْ فَإِنَّ اللَّهَ لَا يُضِيعُ أَجْرَ الْمُحْسِنِين)",
      sourahName: "سورة يوسف: 90"),
  AyaModel(
      id: 21,
      ayaBody:
          "(وَاصْبِرْ وَمَا صَبْركَ إِلَّا بِاللَّهِ وَلَا تَحْزَنْ عَلَيْهِمْ وَلَا تَك فِي ضَيْقٍ مِمَّا يَمْكرونَ)",
      sourahName: "سورة النحل: 127"),
  AyaModel(
      id: 22,
      ayaBody: "(وَقُولُوا لِلنَّاسِ حُسْناً)",
      sourahName: "سورة البقرة: 83"),
  AyaModel(
      id: 23,
      ayaBody:
          "(وَعَسَى أَنْ تَكْرَهُوا شَيْئًا وَهُوَ خَيْرٌ لَكُمْ وَعَسَى أَنْ تُحِبُّوا شَيْئًا وَهُوَ شَرٌّ لَكُمْ وَاللَّهُ يَعْلَمُ وَأَنْتُمْ لَا تَعْلَمُونَ)",
      sourahName: "سورة البقرة: 216"),
  AyaModel(
      id: 24,
      ayaBody: "(وَلَا تَنْسَوُا الْفَضْلَ بَيْنَكُمْ)",
      sourahName: "سورة البقرة: 237"),
  AyaModel(
      id: 25,
      ayaBody: "(وَلَا يَحِيقُ الْمَكْرُ السَّيِّئُ إِلَّا بِأَهْلِه)",
      sourahName: "سورة فاطر: 43"),
  AyaModel(
      id: 26,
      ayaBody: "(وَالَّذِينَ جَاهَدُوا فِينَا لَنَهْدِيَنَّهُمْ سُبُلَنَا)",
      sourahName: "سورة العنكبوت: 69"),
  AyaModel(
      id: 27,
      ayaBody: "(إِنْ جَاءَكُمْ فَاسِقٌ بِنَبَإٍ فَتَبَيَّنُوا)",
      sourahName: "سورة الحجرات: 6"),
  AyaModel(
      id: 28,
      ayaBody:
          "(وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌ أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ فَلْيَسْتَجِيبُوا لِي وَلْيُؤْمِنُوا بِي لَعَلَّهُمْ يَرْشُدُونَ)",
      sourahName: "سورة البقرة: 186"),
  AyaModel(
      id: 29,
      ayaBody:
          "(وَمَا أَصَابَكُمْ مِنْ مُصِيبَةٍ فَبِمَا كَسَبَتْ أَيْدِيكُمْ وَيَعْفُو عَنْ كَثِيرٍ)",
      sourahName: "سورة الشورى: 30"),
  AyaModel(
      id: 30,
      ayaBody: "(إِنَّ الْحَسَنَاتِ يُذْهِبْنَ السَّيِّئَاتِ)",
      sourahName: "سورة هود: 114"),
  AyaModel(
      id: 31,
      ayaBody: "(وَمَا تَفْعَلُوا مِنْ خَيْرٍ يَعْلَمْهُ اللَّهُ)",
      sourahName: "سورة البقرة: 197"),
  AyaModel(
      id: 32,
      ayaBody: "(فَاسْأَلُوا أَهْلَ الذِّكْرِ إِنْ كُنْتُمْ لَا تَعْلَمُونَ)",
      sourahName: "سورة النحل: 43"),
  AyaModel(
      id: 33,
      ayaBody:
          "( وَأَن لَّيْسَ لِلْإِنسَانِ إِلَّا مَا سَعَىٰ .وَأَنَّ سَعْيَهُ سَوْفَ يُرَىٰ )",
      sourahName: "سورة النجم: 39-40"),
  AyaModel(
      id: 34,
      ayaBody:
          "(وَلَا تَسْتَوِي الْحَسَنَة وَلَا السَّيِّئَة ۚ ادْفَعْ بِالَّتِي هِيَ أَحْسَن فَإِذَا الَّذِي بَيْنَكَ وَبَيْنَه عَدَاوَة كَأَنَّه وَلِي حَمِيم)",
      sourahName: "سورة فصلت: 34"),
  AyaModel(
      id: 35,
      ayaBody: "(إِنَّمَا يُوَفَّى الصَّابِرُونَ أَجْرَهُم بِغَيْرِ حِسَابٍ)",
      sourahName: "سورة الزمر: 10"),
  AyaModel(
      id: 36,
      ayaBody:
          "(سَلَامٌ عَلَيْكُمْ بِمَا صَبَرْتُمْ فَنِعْمَ عُقْبَى الدَّارِ)",
      sourahName: "سورة الرعد: 24"),
  AyaModel(
      id: 37,
      ayaBody:
          "(هوَ الَّذِي جَعَلَ لَكم الْأَرْضَ ذَلولًا فَامْشوا فِي مَنَاكِبِهَا وَكلوا مِن رِّزْقِهِ)",
      sourahName: "سورة الملك: 15"),
  AyaModel(
      id: 38,
      ayaBody:
          "(وَيبَشِّر الْمؤْمِنِينَ الَّذِينَ يَعْمَلونَ الصَّالِحَاتِ أَنَّ لَهمْ أَجْرًا كَبِيرًا)",
      sourahName: "سورة الإسراء: 9"),
  AyaModel(
      id: 39,
      ayaBody:
          "(وَتَعَاوَنوا عَلَى الْبِرِّ وَالتَّقْوَى ۖ وَلَا تَعَاوَنوا عَلَى الْإِثْمِ وَالْعدْوَانِ)",
      sourahName: "سوة المائدة: 2"),
  AyaModel(
      id: 40,
      ayaBody:
          "(وَاسْتَعِينُوا بِالصَّبْرِ وَالصَّلَاةِ ۚ وَإِنَّهَا لَكَبِيرَةٌ إِلَّا عَلَى الْخَاشِعِينَ)",
      sourahName: "سورة البقرة: 45"),
  AyaModel(
      id: 41,
      ayaBody:
          "(وَإِن تَعُدُّوا نِعْمَةَ اللَّهِ لَا تُحْصُوهَا ۗ إِنَّ اللَّهَ لَغَفُورٌ رَّحِيمٌ)",
      sourahName: "سورة النحل: 18"),
  AyaModel(
      id: 43,
      ayaBody:
          " (وَأَنْ أَقِيموا الصَّلَاةَ وَاتَّقوه وَهوَ الَّذِي إِلَيْهِ تحْشَرونَ)",
      sourahName: "سورة الأنعام: 72"),
  AyaModel(
      id: 44,
      ayaBody:
          "(وَتَعَاوَنُوا عَلَى الْبِرِّ وَالتَّقْوَى وَلَا تَعَاوَنُوا عَلَى الْإِثْمِ وَالْعُدْوَانِ وَاتَّقُوا اللَّهَ إِنَّ اللَّهَ شَدِيدُ الْعِقَابِ)",
      sourahName: "سورة المائدة: 2"),
  AyaModel(
      id: 45,
      ayaBody:
          "(إِنِّي جَزَيْتُهُمُ الْيَوْمَ بِمَا صَبَرُوا أَنَّهُمْ همُ الْفَائِزُونَ)",
      sourahName: "سورة المؤمنون: 111"),
  AyaModel(
      id: 46,
      ayaBody:
          " (وَمَنْ يَتَّقِ اللَّهَ يَجْعَلْ لَهُ مَخْرَجًا . وَيَرْزُقْهُ مِنْ حَيْثُ لَا يَحْتَسِبُ)",
      sourahName: "سورة الطلاق: 1-2"),
  AyaModel(
      id: 47,
      ayaBody: "(إِنَّ اللَّهَ هوَ الرَّزَّاق ذو الْقوَّةِ الْمَتِين)",
      sourahName: "سورة الذاريات: 58"),
];
 */